Repository: albinoloverats/encrypt
Catalog: po/*.po
Languages: de

source: could not initialize GTK interface
de: konnte nicht initialisiert GTK-schnittstelle

source: could not access input file %s
de: kein zugriff möglich eingabedatei %s

source: could not access/create output file %s
de: kein zugriff / erstellen ausgabedatei %s

source: could not import module function %s
de: import-modul konnte nicht funktion %s

source: an unexpected error has occured
de: ein unerwarteter fehler ist aufgetreten

source: module name cannot be (null)
de: modul kann nicht (null)

source: out of memory at %s:%i
de: ausreichend RAM bei %s:%i

source: could not open plugin %s
de: konnte nicht geöffnet plugin %s

source: missing module name
de: modul-namen fehlen

source: invalid pointer to module
de: ungültigen zeiger auf modul

source: could not find plugin information
de: nicht finden konnten plugin-informationen

source: Algorithm Details
de: Algorithmus Details

source: Authors
de: Autoren

source: Licence
de: Lizenz

source: Year
de: Jahr

source: Block size
de: Blockgröße

source: Key Details
de: Schlüssel Details

source: Key size
de: Größe

source: Additional Details
de: Weitere Details

source: could not access/create key file %s
de: kein zugriff / erstellen schlüssel-Datei %s

source: missing data for key generation
de: fahlenden daten für schlüssel generation

source: could not access key file %s
de: könnte nicht auf schlüssel-datei %s

source: unexpected end of key file %s
de: unerwartetes ende der schlüssel-datei %s

source: could not access passphrase file %s
de: kein zugriff möglich passwort-datei %s

source: unexpected end of passphrase
de: unerwartetes ende der passwort-datei %s

source: invalid key type
de: ungültige schlüssel-typ

source: Installed Modules:
de: Installierte Module:

source: -i, --in FILE Input file
de: -i, --in DATEI Eingabedatei

source: -o, --out FILE Output file
de: -o, --out DATEI Ausgabedatei

source: -k, --keyfile FILE Key file (must come first if generating a key)
de: -k, --keyfile DATEI Schlüssel-Datei (zuerst kommen müssen, wenn die einen Schlüssel)

source: -f, --passfile FILE File to use as passphrase to generate key
de: -f, --passfile DATEI Datei als Passwort zu verwenden, um Schlüssel

source: -p, --password PASSWORD Use given password to generate key
de: -p, --password PASSWORT Verwendung bestimmten Passwort zu generieren Schlüssel

source: -e, --encrypt ALGORITHM Algorithm to use for encryption
de: -e, --encrypt ALGORITHMUS Algorithmus für die Verschlüsselung

source: -d, --decrypt ALGORITHM Algorithm to use for decryption
de: -d, --decrypt ALGORITHMUS Algorithmus für die Entschlüsselung

source: -a, --about ALGORITHM Information about a particular algorithm
de: -a, --about ALGORITHMUS Informationen über enien Algorithmus

source: -g, --generate SIZE Generate a key of specified size (in bits)
de: -g, --generate GRÖßE Schlüssel erzeugen von bestimmten Größe

source: -m, --modules List all available algorithms
de: -m, --modules Liste aller verfügbaren Algorithmus

source: If -i or -o are omitted then stdin/stdout are used. Either -e or -d must be present if you intend to do something, as well as -k -f or -p. Using -g will generate a random key and echo it to stdout unless -g is preceded by -k; the key can be used later with the -k option. However -a -m -h -l -v may be used on their own or not at all.
de: Wenn -i oder -o entfallen dann stdin / stdout werden. Entweder -e oder -d muss vorhanden, wenn Sie die Absicht, etwas zu tun, sowie -k -f oder -p. Mit -g einen zufälligen Schlüssel und Echo an stdout, es sei denn, -g wird mit -k, die -Taste kann verwendet werden, später mit der -k Option. Allerdings -a -m -h -l -v verwendet werden über ihre eigenen oder gar nicht.

source: %s version : %s built on: %s %s %s Website %s Contributors %s Copyright %s Licence %s
de: %s version : %s auf: %s %s %s Website %s Contributors %s Copyright %s Lizenz %s

source: Select a Key / Passphrase File
de: wählen Sie ein Schlüssel / Passwort Datei

source: Select Destination Folder
de: Wählen Sie einen Zielordner

source: Algorithm
de: Algorithmus

source: Password
de: Passwort

source: Destination Directory
de: Zielverzeichnis

source: Destination File Name
de: Ziel Dateinamen

source: Encrypt
de: Versclüsseln

source: Decrypt
de: Entsclüsseln

source: Key
de: Sclüssel

source: Passphrase
de: Passwort

source: About encrypt
de: Über encrypt

source: Generate Key
de: Sclüssel erzeugen

source: _Key
de: Sclüssel

source: _Generate
de: Erzeu_gen

source: Key size (bits)
de: Sclüssel Größe

source: Save As
de: Speichern unter

source: Save In
de: Speichern in

source: Select A Directory
de: Wählen Sie ein Verzeichnis

source: _Execute
de: Ausführ_en

source: Done
de: Getan

source: Missing: file to en/decrypt
de: Missing: datei zum ver/entschlüsseln

source: Missing: destination directory
de: Missing: zielverzeichnis

source: Missing: output file name
de: Missing: ausgabedatei

source: Missing: key file / passphrase file / password
de: Missing schlüssel / passwort

source: Missing: algorithm selection
de: Missing: :auswahl-algorithmus

source: Error: could not open plugin
de: Fehler: konnte nicht geöffent plugin

source: Error: could not access input file
de: Fehler: kein zugriff möglich eingabedatei

source: Error: could not access/create output file
de: Fehler: kein zugriff möglich / erstellen auggabedatei
